; domain
(define (domain spanner)
(:requirements :strips :typing :negative-preconditions)
(:types
location T1 - object
nut spanner man - T1
)
(:predicates
	(at ?x1 - T1 ?x2 - location)
	(carrying ?x1 - man ?x2 - spanner)
	(useable ?x1 - spanner)
	(loose ?x1 - nut)
	(tightened ?x1 - nut)
	(link ?x1 - location ?x2 - location)
)
(:action walk
	:parameters (?x1 - location ?x2 - location ?x3 - man )
	:precondition (and
	(at ?x3 ?x1)
	(link ?x1 ?x2)
	(not(at ?x3 ?x2)))
	:effect (and
	(not(at ?x3 ?x1))
	(at ?x3 ?x2))
)
(:action pickup_spanner
	:parameters (?x1 - location ?x2 - spanner ?x3 - man )
	:precondition (and
	(at ?x3 ?x1)
	(at ?x2 ?x1)
	(not(carrying ?x3 ?x2))
	(useable ?x2))
	:effect (and
	(not(at ?x2 ?x1))
	(carrying ?x3 ?x2))
)
(:action tighten_nut
	:parameters (?x1 - location ?x2 - spanner ?x3 - man ?x4 - nut )
	:precondition (and
	(at ?x3 ?x1)
	(carrying ?x3 ?x2)
	(loose ?x4)
	(at ?x4 ?x1)
	(useable ?x2)
	(not(tightened ?x4)))
	:effect (and
	(not(loose ?x4))
	(not(useable ?x2))
	(tightened ?x4))
)
)

; problem
(define (problem instance8) (:domain spanner) (:objects
     bob - man
 spanner1 spanner2 spanner3 spanner4 spanner5 spanner6 spanner7 spanner8 spanner9 spanner10 - spanner
     nut1 nut2 nut3 - nut
     location1 location2 location3 location4 location5 location6 location7 location8 location9 location10 - location
     shed gate - location
    ) (:init
    (at bob shed)
    (at spanner1 location4)
    (useable spanner1)
    (at spanner2 location7)
    (useable spanner2)
    (at spanner3 location7)
    (useable spanner3)
    (at spanner4 location4)
    (useable spanner4)
    (at spanner5 location10)
    (useable spanner5)
    (at spanner6 location4)
    (useable spanner6)
    (at spanner7 location1)
    (useable spanner7)
    (at spanner8 location2)
    (useable spanner8)
    (at spanner9 location8)
    (useable spanner9)
    (at spanner10 location6)
    (useable spanner10)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (link shed location1)
    (link location1 shed)
    (link location10 gate)
    (link gate location10)
    (link location1 location2)
    (link location2 location1)
    (link location2 location3)
    (link  location3 location2)
    (link location3 location4)
    (link location4 location3)
    (link location4 location5)
    (link location5 location4)
    (link location5 location6)
    (link location6 location5)
    (link location6 location7)
    (link location7 location6)
    (link location7 location8)
    (link location8 location7)
    (link location8 location9)
    (link location9 location8)
    (link location10 location9)
    (link location9 location10)
) (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 3
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 3
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 3
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 3
5. (pickup_spanner location4 spanner6 bob)
   deleted: (at spanner6 location4)
   added: (carrying bob spanner6)
   goals met: 0 of 3
6. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 3
7. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 3
8. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 3
9. (walk location7 location8 bob)
   deleted: (at bob location7)
   added: (at bob location8)
   goals met: 0 of 3
10. (walk location8 location9 bob)
   deleted: (at bob location8)
   added: (at bob location9)
   goals met: 0 of 3
11. (walk location9 location10 bob)
   deleted: (at bob location9)
   added: (at bob location10)
   goals met: 0 of 3
12. (walk location10 gate bob)
   deleted: (at bob location10)
   added: (at bob gate)
   goals met: 0 of 3
13. (tighten_nut gate spanner6 bob nut1)
   deleted: (loose nut1) (useable spanner6)
   added: (tightened nut1)
   goals met: 1 of 3
14. (walk gate location10 bob)
   deleted: (at bob gate)
   added: (at bob location10)
   goals met: 1 of 3
15. (pickup_spanner location10 spanner5 bob)
   deleted: (at spanner5 location10)
   added: (carrying bob spanner5)
   goals met: 1 of 3
16. (walk location10 gate bob)
   deleted: (at bob location10)
   added: (at bob gate)
   goals met: 1 of 3
17. (tighten_nut gate spanner5 bob nut2)
   deleted: (loose nut2) (useable spanner5)
   added: (tightened nut2)
   goals met: 2 of 3
18. (walk gate location10 bob)
   deleted: (at bob gate)
   added: (at bob location10)
   goals met: 2 of 3
19. (walk location10 location9 bob)
   deleted: (at bob location10)
   added: (at bob location9)
   goals met: 2 of 3
20. (walk location9 location8 bob)
   deleted: (at bob location9)
   added: (at bob location8)
   goals met: 2 of 3
21. (pickup_spanner location8 spanner9 bob)
   deleted: (at spanner9 location8)
   added: (carrying bob spanner9)
   goals met: 2 of 3
22. (walk location8 location9 bob)
   deleted: (at bob location8)
   added: (at bob location9)
   goals met: 2 of 3
23. (walk location9 location10 bob)
   deleted: (at bob location9)
   added: (at bob location10)
   goals met: 2 of 3
24. (walk location10 gate bob)
   deleted: (at bob location10)
   added: (at bob gate)
   goals met: 2 of 3
25. (tighten_nut gate spanner9 bob nut3)
   deleted: (loose nut3) (useable spanner9)
   added: (tightened nut3)
   goals met: 3 of 3
